---
kind: property
id: P:Autodesk.Revit.DB.Frame.BasisX
source: html/b28df9ee-1363-aa44-8a8f-db0c631dd797.htm
---
# Autodesk.Revit.DB.Frame.BasisX Property

The first basis vector of the frame.

## Syntax (C#)
```csharp
public XYZ BasisX { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null